{
	"ProjectRation": {
		"Title": "Project Ration",
		"Sub-Title": "BattleHack Toronto",
		"Content": [
			{"Paragraph": "Project Ration is a web application that allows users to donate money to small restaurants & fast-food places so they can give food to the homeless. It was built using MEAN.JS at BattleHack Toronto 2015. We used the Braintree API for transactions and served our content through Heroku. The site is no longer active."},
			{"Paragraph": "Alongside my partner, we were able to put together a solution in order to demo. It was my first-time using the MEAN stack so there was a lot to learn under a short timeframe. It was difficult learning how to use four different frameworks and I know we did not use the stack to its full potential. However, it was a great learning experience, and I learned to read up on frameworks before going to a hackathon."}
		]
	},
	"Clausehound": {
		"Title": "Clausehound",
		"Sub-Title": "Jr. Web Developer · Co-op",
		"Content": [
			{"Paragraph": "I was a Jr. Web Developer at Clausehound for my 2015 Summer Co-op. Here I helped develop their document assembly tool and I worked on a side-project that extracted and matched content from a legal document. I worked mainly with PHP and JQuery and occasionally helping with the front-end HTML/CSS work."},
			{"Paragraph": "Working here taught me how to work with a team of developers & designers, making sure my code was up to a certain standard. I realized I had to think before starting to code so that I would not have to rewrite code every time I ran into a problem."}
		]
	},
	"RideON": {
		"Title": "RideON",
		"Sub-Title": "Software Engineering Term Project",
		"Content": [
			{"Paragraph": "This was a term project for my Software Engineering course at Wilfrid Laurier University. It’s a rideshare app that allows students travel between universities. Instead of checking multiple Facebook groups, a student would be able to check one app that had all the rides in one place. It was developed using the Ionic framework and a Firebase database."},
			{"Paragraph": "Ionic was really powerful with allowing me to rapidly develop this prototype for my project. It allowed me to build my app using tools I already knew, instead of learning the Android SDK from scratch in a few days and hacking together a solution. It was tough developing this by myself, but it was worth it as I was able to learn how to develop an application using the MVC paradigm."}
		]
	},
	"North60": {
		"Title": "North60 Tech",
		"Sub-Title": "Backend Web Developer · Co-op",
		"Content": [
			{"Paragraph": "I worked as a Backend Web Developer at North60 Tech for my 2016 Summer Co-op. Here I developed a REST API using Python, Flask, Flask-RESTful, and a lot of other extensions. I designed some of the database structure and wrote API documentation for my co-workers so they could use the API for the application."},
			{"Paragraph": "Having full control over the backend of the application and how users interacted with the data was pretty intimidating. I had to read up on design principals for creating a RESTful API and what all the HTTP status codes were (I still only know the main ones). Another task I had to do was optimizing queries to the database to serve content to the user faster. In one case, a query that initially took over 7 seconds to perform was reduced to less than a second."}
		]
	},
	"Bars": {
		"Title": "Bars",
		"Sub-Title": "AngelHack Toronto",
		"Content": [
			{"Paragraph": "This is a rap-bot, built with the Facebook Messenger Platform, Node.js, and the Datamuse API to rhyme words, was developed at AngelHack 2016."},
			{"Paragraph": "This was a fun project, trying to figure out how to create a coherent line that made some sense to spit back at the user. I’d say 60% of the hackathon was spent doing this, just tossing ideas at each other to see what sticks on the wall. In order to make the rhyme make some sort of sense, we looked at the last word (the one that we would rhyme) and see what category it fell under. Then, we would look for a rhyme that also was under that category."}
		]
	},
	"SudokuSolver": {
		"Title": "Sudoku Solver",
		"Sub-Title": "Artifical Intelligence Project"
	},
	"N-Queens": {
		"Title": "N-Queens Problem",
		"Sub-Title": "Artificial Intelligence Term Project",
		"Content": [
			{"Paragraph": "This was my Artificial Intelligence Term Project which was solved as a Constraint Satisfaction Problem using Python."}
		]
	},
	"Language Tracker": {
		"Title": "Language Tracker",
		"Sub-Title": "Personal Project"
	}
}
